export const messages = {
  buyers: {
    hero: {
      title: 'Сделайте лучшее предложение и гарантированно продайте урожай',
      description: 'Отправьте своё предложение на продажу, а покупатель выберет лучшие из полученных, чтобы заключить сделку'
    },
    offer: {
      title: 'Предложение покупателя',
      description: 'Если ваш урожай соответствует условиям, которые выдвинул покупатель, отправьте своё предложение на продажу, когда начнётся приём заявок'
    },
    productRequirements: {
      title: 'Требования к товару'
    },
    purchaseRequirements: {
      title: 'Условия покупки'
    },
    betsTable: {
      title: 'Предложения о продаже',
      emptyList: {
        subtitle: 'Предложений ещё нет.',
        description: 'Будьте первыми – сделайте предложение о продаже своего урожая'
      },
      tableHeaders: {
        inn: 'ИНН продавца',
        position: 'Позиция предложения',
        volume: 'Объём партии'
      }
    },
    form: {
      title: 'Ваше предложение о продаже урожая',
      description: 'Предложите цену ниже заявленной покупателем и предложений других продавцов',
      minVolume: 'Минимальный объём продажи',
      minStep: 'Минимальный шаг ставки',
      tooltip: 'В случае если предложение будет признано победившим в проводимом тендере, при условии получения от Оператора оферты, составленной путем включения цены, предложенной мною в предложении на покупку, я (аграрий) обязуюсь акцептовать указанную оферту в сроки, указанные в оферте.'
    }
  },
  sellers: {
    hero: {
      title: 'Сделайте лучшее предложение',
      description: 'Отправьте своё предложение на покупку, а продавец выберет лучшее из полученных для заключения сделки'
    },
    offer: {
      title: 'Предложение продавца',
      description: 'Если вас устраивают характеристики товара и условия продавца, сделайте своё предложение, когда начнётся приём заявок'
    },
    productRequirements: {
      title: 'Характеристики товара'
    },
    purchaseRequirements: {
      title: 'Условия продажи'
    },
    betsTable: {
      title: 'Предложения покупки',
      emptyList: {
        subtitle: 'Предложений ещё нет.',
        description: 'Будьте первыми – сделайте предложение на покупку'
      },
      tableHeaders: {
        inn: 'ИНН покупателя',
        position: 'Позиция предложения',
        volume: 'Объём партии'
      }
    },
    form: {
      title: 'Ваше предложение о покупке урожая',
      description: 'Предложите свою цену',
      minVolume: 'Минимальный объём покупки',
      minStep: 'Минимальный шаг ставки',
      tooltip: ''
    }
  }
}
